realsosy/InfineonRacer/2_src/InfineonRacer_TC23xA/0_Src/4_McHal/Tricore/Asclin/Lin/IfxAsclin_Lin.c
    if (asclin->receiveIdEnable)                       /* if receiving the sent id byte into its own Rx FIFO is selected*/
    {
        IfxAsclin_flushRxFifo(asclinSFR);              /* flushing Rx FIFO*/
        IfxAsclin_enableRxFifoInlet(asclinSFR, TRUE);  /* enabling Rx FIFO */
    }
    else
    {
        IfxAsclin_enableRxFifoInlet(asclinSFR, FALSE); /* disabling Rx FIFO */
    }

    IfxAsclin_flushTxFifo(asclinSFR);                  /* flushing Tx FIFO */
    IfxAsclin_enableTxFifoOutlet(asclinSFR, TRUE);     /* enabling Tx FIFO for transmitting*/
    IfxAsclin_write8(asclinSFR, id, 1U);               /* writing the ID byte */
    IfxAsclin_setTransmitHeaderRequestFlag(asclinSFR); /* setting THRQS flag */
    IfxAsclin_Lin_waitForTransmittedHeader(asclin);    /* waiting until transmit header end acknowledgemnet */
}


void IfxAsclin_Lin_sendResponse(IfxAsclin_Lin *asclin, uint8 *data, uint32 length)
{
    Ifx_ASCLIN *asclinSFR = asclin->asclin;              /* getting the pointer to ASCLIN registers from module handler*/
    IfxAsclin_setDataLength(asclinSFR, length - 1);      /* set number of bytes to be transfered */
    IfxAsclin_clearAllFlags(asclinSFR);                  /* clear all flags */
    IfxAsclin_flushTxFifo(asclinSFR);                    /* flushing Tx FIFO */
    IfxAsclin_enableRxFifoInlet(asclinSFR, FALSE);       /* disable Rx FIFO */
    IfxAsclin_enableTxFifoOutlet(asclinSFR, TRUE);       /* enable Tx FIFO for transmitting */
    IfxAsclin_write8(asclinSFR, data, length);           /* write the data bytes; */
    IfxAsclin_setTransmitResponseRequestFlag(asclinSFR); /* set TRRQS flag */
    IfxAsclin_Lin_waitForTransmittedResponse(asclin);    /* wait until transmit response end acknowledgemnet */
}


void IfxAsclin_Lin_waitForReceivedHeader(IfxAsclin_Lin *asclin)
{
    IfxAsclin_Lin_clearFlagsStatus(asclin);     /* clear all aknowledgement and error flags status */

    /* wait until receive header end acknowledgemnet has been detected  */
    while (asclin->acknowledgmentFlags.rxHeaderEnd != 1)
    {
        IfxAsclin_Lin_checkForReceivedHeaderFlags(asclin);
    }
}


void IfxAsclin_Lin_waitForReceivedResponse(IfxAsclin_Lin *asclin)
{
    IfxAsclin_Lin_clearFlagsStatus(asclin);     /* clear all aknowledgement and error flags status */

    /* wait until receive response end acknowledgemnet has been detected  */
    while (asclin->acknowledgmentFlags.rxResponseEnd != 1)
    {
        IfxAsclin_Lin_checkForReceivedResponseFlags(asclin);
    }
}


void IfxAsclin_Lin_waitForTransmittedHeader(IfxAsclin_Lin *asclin)
{
    IfxAsclin_Lin_clearFlagsStatus(asclin);     /* clear all aknowledgement and error flags status */

    /* wait until transmit header end acknowledgemnet has been detected */
    while (asclin->acknowledgmentFlags.txHeaderEnd != 1)
    {
        IfxAsclin_Lin_checkForTransmittedHeaderFlags(asclin);
    }
}


void IfxAsclin_Lin_waitForTransmittedResponse(IfxAsclin_Lin *asclin)
{
    IfxAsclin_Lin_clearFlagsStatus(asclin);     /* clear all aknowledgement and error flags status */

    /* wait until transmit response end acknowledgemnet has been detected */
    while (asclin->acknowledgmentFlags.txResponseEnd != 1)
    {
        IfxAsclin_Lin_checkForTransmittedResponseFlags(asclin);
    }
}
